MT-backend/app/controllers/api/v1/millennials_controller.rb

  def index
    @millennials = Millennial.all
---
SELECT "millennials".* FROM "millennials"

  def create
    name = params[:millennial][:name]
    thirst = params[:millennial][:thirst]
    gender = params[:millennial][:gender]
    user = User.find(params[:user][:id])
    @millennial = Millennial.create({
      name: name,
      thirst: thirst,
      gender: gender,
      user: user
    })
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "millennials" ("user_id", "name", "thirst", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 6], ["name", "Daniel"], ["thirst", 10], ["gender", "Male"], ["created_at", "2019-05-06 02:09:08.055595"], ["updated_at", "2019-05-06 02:09:08.055595"]]