MT-backend/app/controllers/api/v1/users_controller.rb

  def create
    @user = User.find_by(username: params[:username]) || User.create(username: params[:username])
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Jenjen"], ["created_at", "2019-05-03 16:27:46.080756"], ["updated_at", "2019-05-03 16:27:46.080756"]]
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Jenjen"], ["LIMIT", 1]]